[
  {
    "url": "https://www.dsij.in/dsijarticledetail/multibagger-ev-stock-below-rs-100-with-4895-per-cent-returns-this-ev-company-bags-new-order-worth-rs-1020000000-from-hpcl-and-other-oems-36728-1",
    "dateTime": "2024-02-24T04:51:02Z",
    "author": "Kiran Shroff",
    "title": "EV Stock Surges 4,895% Below Rs 100: Bags Rs 102 Cr Order from HPCL & OEMs",
    "mainText": "In a remarkable feat, Servotech Power Systems Ltd., a leading manufacturer of electric vehicle (EV) chargers in India, has achieved multibagger returns for its investors. The stock, which was once priced at a mere Rs 1.95 per share, has soared to Rs 97.40 per share, delivering an astounding 4,895% return over a span of just 3 years.\n\nThe journey of Servotech’s stock has been nothing short of impressive. From its humble beginnings, it has witnessed exponential growth, rewarding investors handsomely. Let’s delve into the key highlights:\n\n1. Initial Price: At Rs 1.95 per share, Servotech caught the attention of savvy investors looking for hidden gems in the EV sector.\n\n2. Steady Rise: Over the next 3 years, the stock steadily climbed, defying market trends and economic fluctuations.\n\n3. New Order: Recently, Servotech clinched a significant order worth Rs 1,02,00,00,000 (1.02 billion rupees) from Hindustan Petroleum Corporation Limited (HPCL) and other original equipment manufacturers (OEMs). This substantial order further fueled investor confidence and contributed to the stock’s meteoric rise.\n\nAs the world transitions toward cleaner energy and sustainable transportation, electric vehicles have gained prominence. Servotech’s expertise in manufacturing EV chargers positions it strategically in this growing market. The company’s ability to secure large orders from major players like HPCL underscores its credibility and potential for further growth.\n\nServotech Power Systems Ltd. exemplifies the power of innovation, resilience, and strategic vision. Its remarkable journey from a penny stock to a multibagger showcases the immense opportunities in the EV sector. As investors continue to seek promising avenues, Servotech remains a shining example of success.",
    "imgURL": [
      "https://www.dsij.in/Portals/0/EasyDNNnews/36728/535.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://gaadiwaadi.com/4-new-cars-launching-in-the-coming-weeks-tata-to-hyundai/",
    "dateTime": "2024-02-24T04:00:44Z",
    "author": "Surendhar M",
    "title": "4 New Cars Launching In The Coming Weeks - Tata To Hyundai - GaadiWaadi.com",
    "mainText": "In the forthcoming weeks, Indian automobile enthusiasts can anticipate the launch of four exciting new cars from renowned brands such as Tata, Mahindra, Hyundai, and BYD. Each of these manufacturers is gearing up to introduce a distinctive vehicle to the Indian market. Let’s delve into the details of these upcoming launches:\n\n1. 2024 Tata Nexon Dark Edition:\n Scheduled for an early March 2024 debut, Tata Motors is set to unveil the 2024 Nexon Dark Edition, based on the recently facelifted Nexon. The compact SUV will be offered in multiple variants and will be available with a 1.2L petrol and a 1.5L diesel engine, paired with manual and automatic transmission options. It will feature a dark-themed exterior with a multitude of black finishes and Dark Edition badges, and the same theme will be carried onto the interior.\n\n2. Mahindra XUV300 Facelift:\n Although no official timeline has been specified yet, the Mahindra XUV300 facelift is expected to launch in India within the next two months. The front fascia gets a thorough redesign, taking inspiration from the upcoming BE range and the XUV700. While no dimensions changes will be made, the rear end will be revised with connected LED tail lamps and a new bumper. The cabin will be reminiscent of the 2024 XUV400 electric SUV, featuring a 10.25-inch touchscreen infotainment system, an all-digital instrument console, premium surface quality materials, a new dashboard, multiple airbags, dual-zone automatic climate control, and more. The 1.2L turbo petrol and 1.5L turbo diesel engines will continue, and a new automatic transmission will likely join the lineup.\n\n3. Hyundai Creta N Line:\n On March 11, 2024, Hyundai will officially launch the Creta N Line in India. This performance-based model will come with two new color schemes and N Line-based exterior and interior enhancements. It could be offered exclusively with the 1.5L turbo petrol engine, producing 160 PS and 253 Nm. The suspension will have a firmer tuning, and the exhaust note will be sportier compared to the regular model.\n\n4. BYD Seal EV:\n On March 5, 2024, BYD India plans to introduce the Seal electric sedan, which competes with the Tesla Model 3 globally. It is available in three variants in foreign markets and has a claimed driving range of up to 570 km on a single charge. The BYD Seal will be priced above Rs. 50 lakh (ex-showroom).\n\nHere we have explained about the four new cars that will be launched in the coming weeks in India from Tata, Mahindra, Hyundai, and BYD.",
    "imgURL": [
      "https://gaadiwaadi.com/wp-content/uploads/2024/02/Tata-Nexon-EV-Dark-Bharat-Mobility-Global-Expo-2024-1.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://www.livemint.com/market/stock-market-news/indian-stock-market-why-lic-share-price-is-skyrocketing-for-last-four-months-11708744860764.html",
    "dateTime": "2024-02-24T03:30:56Z",
    "author": "Asit Manohar",
    "title": "Indian stock market: Why LIC share price is skyrocketing for last four months? | Mint - Mint",
    "mainText": "In the last four months, shares of Life Insurance Corporation (LIC) of India have witnessed an impressive uptrend. During this period, the LIC share price has surged from approximately ₹600 per share to a remarkable ₹1,066 apiece, delivering an extraordinary 755% return.\n\nReasons Behind the Surge:\n\n1. Strong Q3FY24 Results: LIC’s robust financial performance in the third quarter of the fiscal year 2023-24 has significantly contributed to the stock’s resurgence.\n\n2. Dominant Market Position: As one of India’s largest life insurance providers, LIC’s market dominance and reputation have bolstered investor confidence.\n\n3. Rotation in the PSU Basket: The recent shift in investor focus towards shares that didn’t participate significantly in the PSU stocks rally has also played a role in LIC’s bounceback from its 52-week low.\n\nLIC’s remarkable journey from ₹600 to ₹1,066 per share underscores the resilience and attractiveness of this iconic institution in the Indian stock market.\n\n!Image",
    "imgURL": [
      "https://www.livemint.com/lm-img/img/2024/02/24/1600x900/LIC_share_price_Indian_Stock_market_today_1708745134170_1708745134308.JPG"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://timesofindia.indiatimes.com/gadgets-news/paytm-fastag-account-how-to-deactivate-transfer-balance-and-take-refund/articleshow/107956291.cms",
    "dateTime": "2024-02-24T01:56:00Z",
    "author": "TOI Tech Desk",
    "title": "Paytm Fastag account: How to deactivate, transfer balance and take refund - The Times of India",
    "mainText": "The Reserve Bank directed Paytm Payments Bank (PPBL) to stop accepting deposits after March 15. RBI has directed NPCI to examine Paytm's request to become a Third-Party Application Provider for UPI. NHAI removed PPBL from the list of authorized banks for selling Fastags. On January 31, the Reserve Bank directed Paytm Payments Bank (PPBL) to stop accepting deposits or top-ups in any customer accounts, wallets, FASTTags and other instruments after February 29. The RBI last week extended this date to March 15. RBI has now directed the UPI watchdog, the National Payments Corporation of India (NPCI), to examine the request of Paytm parent company One97 Communication Ltd (OCL) to become a Third-Party Application Provider (TPAP) for the UPI channel for continued UPI operation of the Paytm app. This further becomes important as earlier this month Indian Highways Management Company Ltd (IHMCL), toll collecting arm of state-owned NHAI, removed Paytm Payments Bank from the list of 32 authorised banks that can sell Fastags. However, users who have linked their Paytm account to other banks like ICICI, HDFC, Axis and others need not worry. According to reports quoting NHAI official, India has over 8 crore Fastag users and Paytm Payments Bank (PPBL) has around 30 per cent market share. So what should users with a Fastag account linked to Paytm Payments bank do? Options available to Paytm Fastag users * Consume their Paytm Fastag balance. at the earliest. They can use the balance after March 15 as well. However, the sooner they consume it, the better. After March 15, 2024 users will not be able to top-up or recharge their Fastags issued by Paytm Payments Bank. It is suggested that you procure a new Fastag issued by another bank before March 15, 2024 to avoid any inconvenience. * Seek refund of the money left in their Paytm Fastag account. Can Paytm users transfer the balance from their old Fastag issued by Paytm Payments Bank to a new Fastag obtained from another Bank? According to RBI, credit balance transfer feature is not available in the Fastag product. Therefore, users will have to close their old Fastag issued by Paytm Payments Bank and request the bank for a refund. It is same for National Common Mobility Card (NCMC) issued by Paytm Payments Bank How can Paytm Fastag users seek refund Paytm Fastag users can call on the company's Toll free number: 1800-120-4210 and mention their mobile number against which the tag has been registered along with the Vehicle Registration Number (VRN) or Tag ID. Users can also get in touch with Paytm's customer support through the Paytm app.",
    "imgURL": [
      "https://static.toiimg.com/thumb/msid-107956288,width-1070,height-580,imgsize-109018,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://economictimes.indiatimes.com/industry/media/entertainment/media/mca-asks-sebi-to-share-details-on-zee-could-summon-puneet-goenka/articleshow/107952643.cms",
    "dateTime": "2024-02-24T00:00:00Z",
    "author": "Rashmi Rajput",
    "title": "MCA asks Sebi to share details on Zee, could summon Puneet Goenka - The Economic Times",
    "mainText": "The Ministry of Corporate Affairs (MCA) is currently investigating Zee Entertainment Enterprises Ltd (ZEEL) for alleged violations of corporate governance. The MCA has requested information from the Securities and Exchange Board of India (Sebi) regarding its recent findings on fund diversion, which have been reported in the media. The initial investigation by the MCA revealed that ZEEL's fixed deposits (FDs) were used by Yes Bank to offset loans of related entities of the Essel Group, which includes ZEEL. Since 2019, both the MCA and Sebi have been investigating the group following allegations made by independent directors. The investigations revealed that FDs of Rs 200 crore were used by Yes Bank to settle loans of related parties of the Essel Group. However, recent reports suggest that Sebi has discovered an accounting issue of over Rs 2,000 crore ($241 million), prompting the MCA to request further details. If necessary, Puneet Goenka, the CEO of ZEEL, may be summoned for the investigation. The MCA will also investigate any potential issues of corporate governance and fund diversions by key management personnel.",
    "imgURL": [
      "https://img.etimg.com/thumb/msid-107952670,width-1200,height-630,imgsize-27810,overlay-economictimes/photo.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://indianexpress.com/article/india/rejection-of-final-epf-claims-sees-surge-in-5-yrs-up-from-13-to-34-9177874/",
    "dateTime": "2024-02-23T22:34:02Z",
    "author": "Aanchal Magazine",
    "title": "Rejection of final EPF claims sees surge in 5 years, up from 13% to 34% - The Indian Express",
    "mainText": "The rejection rate of final Employees Provident Fund (EPF) claims has seen a significant increase over the past five years, rising from around 13% in 2017-18 to nearly 34% in 2022-23. This means that more than one in every three claims for final settlement of provident fund amount made by the members is being turned down by the Employees Provident Fund Organisation (EPFO). The primary reasons for this surge in rejection rates are attributed to the complete shift to the online system for processing claims and discrepancies in data due to this shift. The retirement fund body of EPFO has over 29 crore total subscribers, out of which around 6.8 crore are active contributing subscribers. There have been instances where EPF subscribers have faced issues with their final settlement claims. For example, KP Sivaraman, a retired employee of a tyre manufacturing company, made multiple visits over the last nine years to the Kochi office of the EPFO to get his final PF dues. Unfortunately, he committed suicide after consuming poison inside the EPF office due to the rejection of his PF amount because of a mismatch in the identification details in his PF records and his official documents. Similarly, other EPF subscribers have also faced issues with their final settlement claims due to data mismatches.",
    "imgURL": [
      "https://images.indianexpress.com/2024/02/epfo-1200-1-1.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://www.fxstreet.com/cryptocurrencies/news/bitcoin-price-breakdown-possible-as-european-central-bank-says-btc-fair-value-is-still-zero-202402221900",
    "dateTime": "2024-02-23T21:07:17Z",
    "author": "Lockridge Okoth",
    "title": "Bitcoin price eyes $48,000 as European Central Bank tears down at BTC after spot ETF approval - FXStreet",
    "mainText": "Bitcoin price continues to hold the $51,335 support, but the depressed outlook continues to become heavier. BTC could make a 10% fall before the next leg up as multiple technical indicators flash bearish signs. A higher high above $52,985 would invalidate the bearish thesis, opening the possibility for more gains. Bitcoin (BTC) price is beginning to lean south after a multi-day consolidation, with bearish forces coming from, among others, recent reports that the European Central Bank (ECB) does not believe in the convenience of BTC. In a Thursday blog titled “ETF approval for Bitcoin – the naked emperor’s new clothes”, the European Central Bank (ECB) detailed an analysis of the Bitcoin market, saying that the king of cryptocurrency “has failed on the promise to be a global decentralized digital currency,” adding that BTC “is still hardly used for legitimate transfers.” The blog also argues that despite the landmark approval of spot BTC exchange-traded funds (ETFs) on January 10, BTC is still not suitable as a means of payment or as an investment. The ECB contravenes the general opinion among crypto proponents that ETF approvals validate BTC as a safe investment. The Central Bank also said that the preceding rally seen in Bitcoin price following the approvals is proof of an unstoppable triumph is false, highlighting that the fair value of Bitcoin remains zero. We disagree with both claims and reiterate that the fair value of Bitcoin is still zero…the use of ETFs as financing vehicles does not change the fair value of the underlying assets. The ECB says that there is a worst-case scenario where Bitcoin’s expected boom fails, urging traders to brace for massive collateral damage, including the “ultimate redistribution of wealth at the expense of the less sophisticated.” Debunking the “false promises of Bitcoin” and warning of the social dangers if not effectively addressed, the blog argued: Bitcoin has not lived up to its original promise to become a global decentralized digital currency. Bitcoin’s promise to be a financial asset whose value would inevitably continue to rise is equally wrong. Bitcoin transactions are still inconvenient, slow, and costly. Bitcoin is still not suitable as an investment. Bitcoin mining using the proof of work (PoW) mechanism pollutes the environment on the same scale as entire countries.",
    "imgURL": [
      "https://editorial.fxstreet.com/images/Markets/Cryptocurrencies/Bitcoin/bitcoin_RSI_02232022_Large.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  },
  {
    "url": "https://www.moneycontrol.com/news/business/dabur-eyes-rs-10000-crore-turnover-from-healthcare-segment-by-2024-8277431.html",
    "dateTime": "2024-02-23T17:18:56Z",
    "author": "CNBC-TV18",
    "title": "Dabur eyes Rs 10,000 crore turnover from healthcare segment by 2024 - Moneycontrol.com",
    "mainText": "Dabur India, a leading FMCG company, is aiming to achieve a turnover of Rs 10,000 crore from its healthcare segment by 2024. The company plans to drive this growth through aggressive marketing, increased penetration, and innovation. Dabur has a diverse product portfolio in the healthcare segment, including over-the-counter medicines, health supplements, and Ayurvedic specialties. The company believes that the growing awareness and adoption of Ayurvedic products, coupled with the increasing demand for health and wellness products amid the ongoing pandemic, will help it achieve this target. Dabur has been strengthening its healthcare segment through new product launches and expansion of its distribution network. The company is also leveraging digital platforms for marketing and sales to reach a wider consumer base.",
    "imgURL": [
      "https://static-news.moneycontrol.com/static-mcnews/2022/10/dabur-770x433.jpg"
    ],
    "quiz": null,
    "userQuizStatus": [],
    "category": "business"
  }
]